In [1]:
import pandas as pd

In [90]:
from sklearn.datasets import load_diabetes

In [91]:
dataset = load_diabetes()
df = pd.DataFrame(data = dataset.data, columns = dataset.feature_names)
df.head(3)

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019908,-0.017646
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068330,-0.092204
2,0.085299,0.050680,0.044451,-0.005671,-0.045599,-0.034194,-0.032356,-0.002592,0.002864,-0.025930

In [92]:
df["Y"] = dataset.target
df.head(3)

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6,Y
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019908,-0.017646,151.0
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068330,-0.092204,75.0
2,0.085299,0.050680,0.044451,-0.005671,-0.045599,-0.034194,-0.032356,-0.002592,0.002864,-0.025930,141.0

# Creating a dataframe

In [51]:
dataframe = pd.DataFrame()

In [52]:
dataframe["Name"] = ["Megh", "Brishti", "Shravaan"]
dataframe["Age"] = [23, 24, 2]
dataframe["Sex"] = ["Male", "Female", "Male"]

In [53]:
dataframe

       Name  Age     Sex
0      Megh   23    Male
1   Brishti   24  Female
2  Shravaan    2    Male

In [54]:
#append row
new_person = pd.Series(["Prarthona", 2, "Female"], index = ["Name", "Age", "Sex"])
dataframe = dataframe.append(new_person, ignore_index = True)
dataframe

        Name  Age     Sex
0       Megh   23    Male
1    Brishti   24  Female
2   Shravaan    2    Male
3  Prarthona    2  Female

# Describing the data

In [37]:
dataframe.shape

(3, 3)

In [27]:
dataframe.describe() #notice only the numeric columns

             Age
count   3.000000
mean   16.333333
std    12.423097
min     2.000000
25%    12.500000
50%    23.000000
75%    23.500000
max    24.000000

# Navigating dataframes

In [28]:
dataframe.iloc[0]

Name    Megh
Age       23
Sex     Male
Name: 0, dtype: object

In [29]:
dataframe.loc[0]

Name    Megh
Age       23
Sex     Male
Name: 0, dtype: object

In [30]:
df[1:4]

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6,Y
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068330,-0.092204,75.0
2,0.085299,0.050680,0.044451,-0.005671,-0.045599,-0.034194,-0.032356,-0.002592,0.002864,-0.025930,141.0
3,-0.089063,-0.044642,-0.011595,-0.036656,0.012191,0.024991,-0.036038,0.034309,0.022692,-0.009362,206.0

In [31]:
df.iloc[1:4]

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6,Y
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068330,-0.092204,75.0
2,0.085299,0.050680,0.044451,-0.005671,-0.045599,-0.034194,-0.032356,-0.002592,0.002864,-0.025930,141.0
3,-0.089063,-0.044642,-0.011595,-0.036656,0.012191,0.024991,-0.036038,0.034309,0.022692,-0.009362,206.0

In [61]:
#it's possible to set index of a df to any value
dataframe = dataframe.set_index(dataframe["Name"])
dataframe

                Name  Age     Sex
Name
Megh            Megh   23    Male
Brishti      Brishti   24  Female
Shravaan    Shravaan    2    Male
Prarthona  Prarthona    2  Female

In [68]:
dataframe.iloc[1] #use iloc to find the data at an exact index e.g. 9th index no matter what the format of the index

Name    Brishti
Age          24
Sex      Female
Name: Brishti, dtype: object

In [67]:
dataframe.loc["Brishti"] #use loc if index is in string format

Name    Brishti
Age          24
Sex      Female
Name: Brishti, dtype: object

# Selecting rows based on conditionals

In [70]:
dataframe[dataframe["Sex"] == "Female"]

                Name  Age     Sex
Name
Brishti      Brishti   24  Female
Prarthona  Prarthona    2  Female

In [77]:
dataframe[(dataframe["Sex"] == "Male") & (dataframe["Age"] > 22)]

      Name  Age   Sex
Name
Megh  Megh   23  Male

# Replacing values

In [103]:
dataframe = Out[61]

In [104]:
dataframe["Sex"].replace("Female", "Woman")

Name
Megh          Male
Brishti      Woman
Shravaan      Male
Prarthona    Woman
Name: Sex, dtype: object

In [105]:
dataframe

                Name  Age     Sex
Name
Megh            Megh   23    Male
Brishti      Brishti   24  Female
Shravaan    Shravaan    2    Male
Prarthona  Prarthona    2  Female

In [106]:
#replace multiple values same time
dataframe["Sex"].replace(["Female", "Male"], ["Woman", "Man"])

Name
Megh           Man
Brishti      Woman
Shravaan       Man
Prarthona    Woman
Name: Sex, dtype: object

In [107]:
dataframe

                Name  Age     Sex
Name
Megh            Megh   23    Male
Brishti      Brishti   24  Female
Shravaan    Shravaan    2    Male
Prarthona  Prarthona    2  Female

# Renaming columns

In [108]:
dataframe.rename(columns = {"Sex": "Gender"})

                Name  Age  Gender
Name
Megh            Megh   23    Male
Brishti      Brishti   24  Female
Shravaan    Shravaan    2    Male
Prarthona  Prarthona    2  Female

In [110]:
dataframe.rename(columns = {"Gender": "Sex", "Name": "Names"})

               Names  Age     Sex
Name
Megh            Megh   23    Male
Brishti      Brishti   24  Female
Shravaan    Shravaan    2    Male
Prarthona  Prarthona    2  Female

In [111]:
import collections

In [112]:
column_names = collections.defaultdict(str)
for name in dataframe.columns:
    column_names[name]

In [113]:
column_names

defaultdict(str, {'Name': '', 'Age': '', 'Sex': ''})

In [114]:
dataframe.keys()

Index(['Name', 'Age', 'Sex'], dtype='object')

# Finding the min, max, sum, avg and count

In [120]:
dataframe["Age"].max(), dataframe["Age"].min(), dataframe["Age"].mean(), dataframe["Age"].sum(), dataframe["Age"].count()

(24, 2, 12.75, 51, 4)

In [123]:
dataframe.var()

Age    154.25
dtype: float64

In [124]:
dataframe.std()

Age    12.419742
dtype: float64

In [126]:
dataframe.kurt() #kurtosis

Age   -5.967611
dtype: float64

In [127]:
dataframe.skew()

Age    0.005611
dtype: float64

In [128]:
dataframe.sem() #standard error of the mean

Age    6.209871
dtype: float64

In [131]:
dataframe["Age"].median()

12.5

# Finding unique values

In [133]:
dataframe["Sex"].unique()

array(['Male', 'Female'], dtype=object)

In [135]:
#number of times each unique value appears
dataframe["Sex"].value_counts()

Male      2
Female    2
Name: Sex, dtype: int64

In [137]:
dataframe.nunique() #number of unique values

Name    4
Age     3
Sex     2
dtype: int64

# Handling missing values

In [141]:
dataframe.isnull(), df.isnull()

(            Name    Age    Sex
 Name
 Megh       False  False  False
 Brishti    False  False  False
 Shravaan   False  False  False
 Prarthona  False  False  False,
        age    sex    bmi     bp     s1     s2     s3     s4     s5     s6  \
 0    False  False  False  False  False  False  False  False  False  False
 1    False  False  False  False  False  False  False  False  False  False
 2    False  False  False  False  False  False  False  False  False  False
 3    False  False  False  False  False  False  False  False  False  False
 4    False  False  False  False  False  False  False  False  False  False
 ..     ...    ...    ...    ...    ...    ...    ...    ...    ...    ...
 437  False  False  False  False  False  False  False  False  False  False
 438  False  False  False  False  False  False  False  False  False  False
 439  False  False  False  False  False  False  False  False  False  False
 440  False  False  False  False  False  False  False  False  False  False
 441  False  False  False  False  False  False  False  False  False  False

          Y
 0    False
 1    False
 2    False
 3    False
 4    False
 ..     ...
 437  False
 438  False
 439  False
 440  False
 441  False

 [442 rows x 11 columns])

In [143]:
dataframe.isnull().sum(), df.isnull().sum()

(Name    0
 Age     0
 Sex     0
 dtype: int64,
 age    0
 sex    0
 bmi    0
 bp     0
 s1     0
 s2     0
 s3     0
 s4     0
 s5     0
 s6     0
 Y      0
 dtype: int64)

In [146]:
#if there's any NaN value replace those values with other values
#first import numpy since numpy is not native in pandas
#df["Sex"] = df["Sex"].replace("Male", np.nan)
#if the missing values are indicated using NaN, NONE or -999 then replace all those values
#df = pd.read_csv(url, na_values = [np.nan, "NONE", -999])

# Deleting a column

In [148]:
df.head(3)

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6,Y
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019908,-0.017646,151.0
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068330,-0.092204,75.0
2,0.085299,0.050680,0.044451,-0.005671,-0.045599,-0.034194,-0.032356,-0.002592,0.002864,-0.025930,141.0

In [149]:
df.drop("s1", axis = 1).head(3)

,age,sex,bmi,bp,s2,s3,s4,s5,s6,Y
0,0.038076,0.050680,0.061696,0.021872,-0.034821,-0.043401,-0.002592,0.019908,-0.017646,151.0
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.019163,0.074412,-0.039493,-0.068330,-0.092204,75.0
2,0.085299,0.050680,0.044451,-0.005671,-0.034194,-0.032356,-0.002592,0.002864,-0.025930,141.0

In [151]:
df.drop(["s2", "s3"], axis = 1).head(3)

,age,sex,bmi,bp,s1,s4,s5,s6,Y
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.002592,0.019908,-0.017646,151.0
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.039493,-0.068330,-0.092204,75.0
2,0.085299,0.050680,0.044451,-0.005671,-0.045599,-0.002592,0.002864,-0.025930,141.0

In [154]:
df.head(3)

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6,Y
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019908,-0.017646,151.0
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068330,-0.092204,75.0
2,0.085299,0.050680,0.044451,-0.005671,-0.045599,-0.034194,-0.032356,-0.002592,0.002864,-0.025930,141.0

In [158]:
df.drop(df.columns[0], axis = 1).head(3) #if a column does not have a name then this code will be useful

,sex,bmi,bp,s1,s2,s3,s4,s5,s6,Y
0,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019908,-0.017646,151.0
1,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068330,-0.092204,75.0
2,0.050680,0.044451,-0.005671,-0.045599,-0.034194,-0.032356,-0.002592,0.002864,-0.025930,141.0

# Deleting a row

In [159]:
dataframe_dropped = dataframe[dataframe["Sex"] != "Female"]

In [160]:
dataframe_dropped

              Name  Age   Sex
Name
Megh          Megh   23  Male
Shravaan  Shravaan    2  Male

In [161]:
#saving the modified dataframe into another variable is a good practice

# Dropping duplicate rows

In [162]:
#df.drop_duplicates()

In [169]:
#subset of columns to check for duplicate rows
df.drop_duplicates(subset = ["sex"]) #find out why only 2 rows are left

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6,Y
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019908,-0.017646,151.0
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068330,-0.092204,75.0

In [170]:
#keeps the first occurence of a duplicated row
#what if we want to keep the last?
df.drop_duplicates(subset = ["sex"], keep = "last")

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6,Y
439,0.041708,0.050680,-0.015906,0.017282,-0.037344,-0.013840,-0.024993,-0.011080,-0.046879,0.015491,132.0
441,-0.045472,-0.044642,-0.073030,-0.081414,0.083740,0.027809,0.173816,-0.039493,-0.004220,0.003064,57.0

In [176]:
df.duplicated().sum() #number of duplicated rows

0

# Grouping rows by values

In [178]:
dataframe.groupby("Sex").mean()

         Age
Sex
Female  13.0
Male    12.5

In [189]:
dataframe.groupby("Sex")["Age"].mean()

Sex
Female    13.0
Male      12.5
Name: Age, dtype: float64

In [190]:
dataframe.groupby(["Sex", "Age"])["Age"].mean()

Sex     Age
Female  2       2
        24     24
Male    2       2
        23     23
Name: Age, dtype: int64

# Grouping rows by time

In [191]:
time_index = pd.date_range("01/01/2022", periods = 100000, freq = "30S")

In [192]:
dft = pd.DataFrame(index = time_index)

In [193]:
dft.head(3)

Empty DataFrame
Columns: []
Index: [2022-01-01 00:00:00, 2022-01-01 00:00:30, 2022-01-01 00:01:00]

In [196]:
import numpy as np
dft["sale_amount"] = np.random.randint(1, 10, 100000)
dft.head(3)

                     sale_amount
2022-01-01 00:00:00            4
2022-01-01 00:00:30            7
2022-01-01 00:01:00            6

In [198]:
#group rows by week, calculate sum per week
dft.resample("W").sum()

            sale_amount
2022-01-02        28869
2022-01-09       100746
2022-01-16       100448
2022-01-23       100965
2022-01-30       101372
2022-02-06        68012

In [201]:
dft.resample("W").sum().shape

(6, 1)

In [207]:
dft.resample("2W").sum()

            sale_amount
2022-01-02        28869
2022-01-16       201194
2022-01-30       202337
2022-02-13        68012

In [208]:
dft.resample("M").sum()

            sale_amount
2022-01-31       446880
2022-02-28        53532

# Looping over a column

In [211]:
for name in dataframe["Name"][2:4]:
    print(name.upper())

SHRAVAAN
PRARTHONA

In [212]:
#list comprehensions
[name.upper() for name in dataframe["Name"][2:4]]

['SHRAVAAN', 'PRARTHONA']

# Applying a function over all elements in a column

In [213]:
def uppercase(x):
    return x.upper()

In [218]:
dataframe["Name"].apply(uppercase)[2:4]

Name
Shravaan      SHRAVAAN
Prarthona    PRARTHONA
Name: Name, dtype: object

# Applying a function to groups

In [219]:
dataframe.groupby("Sex").apply(lambda x: x.count())

        Name  Age  Sex
Sex
Female     2    2    2
Male       2    2    2

# Concatenating dataframes

In [220]:
df1 = {"Name": ["Megh", "John", "Song"],
      "Age": [23, 20, 22],
      "Sex": ["Male", "Male", "Male"]}
df2 = {"Name": ["Brishti", "Hannah", "Nancy"],
      "Age": [21, 19, 23],
      "Sex": ["Female", "Female", "Female"]}

In [221]:
df1 = pd.DataFrame(df1, columns = ["Name", "Age", "Sex"])
df2 = pd.DataFrame(df2, columns = ["Name", "Age", "Sex"])

In [222]:
pd.concat([df1, df2], axis = 0) #concatenating by rows

      Name  Age     Sex
0     Megh   23    Male
1     John   20    Male
2     Song   22    Male
0  Brishti   21  Female
1   Hannah   19  Female
2    Nancy   23  Female

In [225]:
pd.concat([df1, df2], axis = 1) #concatenating by columns, but notice there's a problem in the columns

   Name  Age   Sex     Name  Age     Sex
0  Megh   23  Male  Brishti   21  Female
1  John   20  Male   Hannah   19  Female
2  Song   22  Male    Nancy   23  Female

In [228]:
#we can use append to add a new row to a dataframe
new_row = pd.Series(["Taylor", 32, "Female"], index = ["Name", "Age", "Sex"])
df2 = df2.append(new_row, ignore_index = True)

In [233]:
df2

      Name  Age     Sex
0  Brishti   21  Female
1   Hannah   19  Female
2    Nancy   23  Female
3   Taylor   32  Female

# Merging dataframes

In [239]:
employee_data = pd.DataFrame(data = {
    "employee_id": ["1", "2", "3", "10", "11"],
    "name": ["Megh", "Brishti", "Riti", "Kriti", "Titi"],
}, columns = ["employee_id", "name"])
sales_data = pd.DataFrame(data = {
    "employee_id": ["1", "2", "3", "4", "5", "6", "7", "8", "9"],
    "total_sales": [100, 100, 200, 200, 20, 1000, 200, 10, 10]
}, columns = ["employee_id", "total_sales"])

In [240]:
pd.merge(employee_data, sales_data, on = "employee_id")

  employee_id     name  total_sales
0           1     Megh          100
1           2  Brishti          100
2           3     Riti          200

In [241]:
pd.merge(employee_data, sales_data, on = "employee_id", how = "outer")

   employee_id     name  total_sales
0            1     Megh        100.0
1            2  Brishti        100.0
2            3     Riti        200.0
3           10    Kriti          NaN
4           11     Titi          NaN
5            4      NaN        200.0
6            5      NaN         20.0
7            6      NaN       1000.0
8            7      NaN        200.0
9            8      NaN         10.0
10           9      NaN         10.0

In [242]:
pd.merge(employee_data, sales_data, on = "employee_id", how = "left")

  employee_id     name  total_sales
0           1     Megh        100.0
1           2  Brishti        100.0
2           3     Riti        200.0
3          10    Kriti          NaN
4          11     Titi          NaN

In [243]:
pd.merge(employee_data, sales_data, on = "employee_id", how = "right")

  employee_id     name  total_sales
0           1     Megh          100
1           2  Brishti          100
2           3     Riti          200
3           4      NaN          200
4           5      NaN           20
5           6      NaN         1000
6           7      NaN          200
7           8      NaN           10
8           9      NaN           10